app/Controllers/Accessories.php

SELECT `accessories`.*, `user_details`.`full_name` as `assigned_to`
FROM `accessories`
LEFT JOIN `user_details` ON `user_details`.`user_id` = `accessories`.`assigned_user_id`
SELECT *
FROM `user_details`
ORDER BY `full_name` ASC
---
    public function items()
    {
        $items = $this->accessoryModel->select('accessories.*, user_details.full_name as assigned_to')
            ->join('user_details', 'user_details.user_id = accessories.assigned_user_id', 'left')
            ->findAll();

        $data = [
            'items' => $items,
            'users' => $this->userDetailModel->orderBy('full_name', 'ASC')->findAll(),
            'page_title' => 'Accessories Inventory'
        ];