app/Controllers/Admin.php

    public function index()
    {
        if (!$this->checkAdmin())
            return redirect()->to('dashboard')->with('error', 'Access Denied');

        $data = [
            'users' => $this->userModel->select('users.*, user_details.full_name, user_details.email, r.role_name as system_role, d.department_name')
                ->join('user_details', 'user_details.user_id = users.id')
                ->join('roles r', 'r.id = users.system_role_id')
                ->join('departments d', 'd.id = user_details.department_id', 'left')
                ->findAll(),
            'page_title' => 'User Management'
        ];
---
SELECT `users`.*, `user_details`.`full_name`, `user_details`.`email`, `r`.`role_name` as `system_role`, `d`.`department_name`
FROM `users`
JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
JOIN `roles` `r` ON `r`.`id` = `users`.`system_role_id`
LEFT JOIN `departments` `d` ON `d`.`id` = `user_details`.`department_id`

    public function create()
    {
        if (!$this->checkAdmin())
            return redirect()->to('dashboard');

        $data = [
            'roles' => $this->db->table('roles')->where('role_type', 'system')->get()->getResultArray(),
            'div_roles' => $this->db->table('roles')->where('role_type', 'divisional')->get()->getResultArray(),
            'departments' => $this->departmentModel->findAll(),
            'page_title' => 'Create User'
        ];
---
SELECT *
FROM `roles`
WHERE `role_type` = 'divisional'
SELECT *
FROM `departments`

    public function edit($id)
    {
        if (!$this->checkAdmin())
            return redirect()->to('dashboard');

        $user = $this->userModel->select('users.*, user_details.full_name, user_details.epf_number, user_details.email, user_details.department_id')
            ->join('user_details', 'user_details.user_id = users.id')
            ->where('users.id', $id)
            ->first();

        $data = [
            'user' => $user,
            'roles' => $this->db->table('roles')->where('role_type', 'system')->get()->getResultArray(),
            'div_roles' => $this->db->table('roles')->where('role_type', 'divisional')->get()->getResultArray(),
            'departments' => $this->departmentModel->findAll(),
            'page_title' => 'Edit User'
        ];
---
SELECT `users`.*, `user_details`.`full_name`, `user_details`.`epf_number`, `user_details`.`email`, `user_details`.`department_id`
FROM `users`
JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
WHERE `users`.`id` = '4'
 LIMIT 1
SELECT *
FROM `roles`
WHERE `role_type` = 'divisional'
SELECT *
FROM `departments`

    public function update($id)
    {
        if (!$this->checkAdmin())
            return redirect()->to('dashboard');

        $currentUser = $this->userModel->find($id);
        $changes = [];

        // Check for role change
        if ($currentUser['system_role_id'] != $this->request->getPost('system_role')) {
            $changes[] = "System Role changed";
        }

        // Update User Table
        $userData = [
            'system_role_id' => $this->request->getPost('system_role'),
            'divisional_role_id' => $this->request->getPost('divisional_role'),
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        // Check password change
        $newPass = $this->request->getPost('password');
        if (!empty($newPass)) {
            $userData['password'] = password_hash($newPass, PASSWORD_DEFAULT);
            $changes[] = "Password changed";
        }

        $this->userModel->update($id, $userData);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'
UPDATE `users` SET `system_role_id` = '1', `divisional_role_id` = '5', `updated_at` = '2026-02-14 19:16:13'
WHERE `users`.`id` IN ('4')

        ];

        // Detailed check could be done here, simplification for now
        $this->db->table('user_details')->where('user_id', $id)->update($userDetails);
---
UPDATE `user_details` SET `full_name` = 'Super Administrator', `epf_number` = '001', `email` = 'ict.intern@casrilanka.org', `department_id` = '20'
WHERE `user_id` = '4'