app/Controllers/Departments.php

SELECT `departments`.*, `user_details`.`full_name` as `manager_name`
FROM `departments`
LEFT JOIN `users` ON `users`.`id` = `departments`.`manager_id`
LEFT JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
SELECT `users`.`id`, `user_details`.`full_name`, `r`.`role_name`
FROM `users`
JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
LEFT JOIN `roles` `r` ON `r`.`id` = `users`.`system_role_id`
---
    public function index()
    {
        if (!$this->checkAccess()) return redirect()->to('dashboard')->with('error', 'Access Denied');

        $data = [
            'departments' => $this->departmentModel->select('departments.*, user_details.full_name as manager_name')
                                ->join('users', 'users.id = departments.manager_id', 'left')
                                ->join('user_details', 'user_details.user_id = users.id', 'left')
                                ->findAll(),
            'users' => $this->userModel->select('users.id, user_details.full_name, r.role_name')
                        ->join('user_details', 'user_details.user_id = users.id')
                        ->join('roles r', 'r.id = users.system_role_id', 'left')
                        ->findAll(),
            'page_title' => 'Manage Departments'
        ];