app/Controllers/Inventory.php

    public function view($id)
    {
        $item = $this->assetModel->select('assets.*, departments.department_name, user_details.full_name as assigned_to')
            ->join('departments', 'departments.id = assets.department_id', 'left')
            ->join('user_details', 'user_details.user_id = assets.assigned_user_id', 'left')
            ->find($id);

        if (!$item)
            return redirect()->to('inventory/items')->with('error', 'Item not found');

        $data = [
            'item' => $item,
            'departments' => $this->deptModel->findAll(),
            'users' => (new UserDetailModel())->select('user_id, full_name')->findAll(),
            'page_title' => 'Manage Asset: ' . $item['serial_number']
        ];
---
SELECT `inv_items`.*, `inv_models`.`model_name`, `inv_categories`.`name` as `category_name`, `inv_manufacturers`.`name` as `manufacturer_name`
FROM `inv_items`
LEFT JOIN `inv_models` ON `inv_models`.`id` = `inv_items`.`model_id`
LEFT JOIN `inv_categories` ON `inv_categories`.`id` = `inv_models`.`category_id`
LEFT JOIN `inv_manufacturers` ON `inv_manufacturers`.`id` = `inv_models`.`manufacturer_id`
WHERE `inv_items`.`id` = '2'
SELECT `users`.`id`, `ud`.`full_name`
FROM `users`
JOIN `user_details` `ud` ON `ud`.`user_id` = `users`.`id`
SELECT `user_id`, `full_name`
FROM `user_details`