app/Controllers/Inventory.php

    public function index()
    {
        // Stats for Dashboard
        $data = [
            'total_assets' => $this->assetModel->countAllResults(),
            'by_status' => $this->assetModel->select('status, COUNT(*) as count')->groupBy('status')->findAll(),
            'by_type' => $this->assetModel->select('type, COUNT(*) as count')->groupBy('type')->findAll(),
            'by_dept' => $this->assetModel->select('IFNULL(departments.department_name, "Unassigned") as department, COUNT(*) as count')
                ->join('departments', 'departments.id = assets.department_id', 'left')
                ->groupBy('assets.department_id')
                ->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `assets`
SELECT `status`, COUNT(*) as count
FROM `assets`
GROUP BY `status`
SELECT IFNULL(departments.department_name, "Unassigned") as department, COUNT(*) as count
FROM `assets`
LEFT JOIN `departments` ON `departments`.`id` = `assets`.`department_id`
GROUP BY `assets`.`department_id`

    public function scan()
    {
        $data = [
            'users' => $this->userDetailModel->orderBy('full_name', 'ASC')->findAll()
        ];
---
SELECT *
FROM `user_details`
ORDER BY `full_name` ASC

    public function view($id)
    {
        $item = $this->assetModel->find($id);
        if (!$item) {
            return redirect()->to('inventory')->with('error', 'Asset not found');
        }

        $data = [
            'item' => $item,
            'departments' => $this->departmentModel->findAll(),
            'users' => $this->userDetailModel->findAll()
        ];
---
SELECT `assets`.*, `departments`.`department_name`, `user_details`.`full_name` as `assigned_to`
FROM `assets`
LEFT JOIN `departments` ON `departments`.`id` = `assets`.`department_id`
LEFT JOIN `user_details` ON `user_details`.`user_id` = `assets`.`assigned_user_id`
ORDER BY `assets`.`created_at` DESC
SELECT *
FROM `departments`
SELECT `assets`.*, `departments`.`department_name`, `user_details`.`full_name` as `assigned_to`
FROM `assets`
LEFT JOIN `departments` ON `departments`.`id` = `assets`.`department_id`
LEFT JOIN `user_details` ON `user_details`.`user_id` = `assets`.`assigned_user_id`
WHERE `assets`.`id` = '1'

    public function generateQR($id)
    {
        $item = $this->assetModel->find($id);
---
SELECT *
FROM `assets`
WHERE `assets`.`id` = '4'

    public function getAssetByCode()
    {
        $code = $this->request->getGet('code');
        if (empty($code)) {
            return $this->response->setJSON(['success' => false, 'message' => 'No code provided']);
        }

        // Try searching by asset_code first, then serial_number
        $asset = $this->assetModel->where('asset_code', $code)
            ->orWhere('serial_number', $code)
            ->first();

        // If not found, check if it's a numeric ID (fallback)
        if (!$asset && is_numeric($code)) {
            $asset = $this->assetModel->find($code);
        }

        if ($asset) {
            // Get current user if assigned
            $assignedTo = null;
            if ($asset['assigned_user_id']) {
                $user = $this->userDetailModel->where('user_id', $asset['assigned_user_id'])->first();
---
SELECT *
FROM `assets`
WHERE `asset_code` = 'NXVPKSG00T1291CC697600'
OR `serial_number` = 'NXVPKSG00T1291CC697600'
 LIMIT 1
SELECT *
FROM `user_details`
WHERE `user_id` = '4'
 LIMIT 1