app/Controllers/Onboarding.php

SELECT *
FROM `departments`
WHERE `department_name` = 'HR'
 LIMIT 1
---
                $initiatorName = session()->get('full_name');

                // 3. Get HR HOD Email (Manager of HR department)
                $hrDept = $this->departmentModel->where('department_name', 'HR')->first();

SELECT *
FROM `departments`
WHERE `departments`.`id` = '19'
---
                }

                // Prepare Content Data
                $dept = $this->departmentModel->find($data['department_id']);

SELECT `onboarding_requests`.*, `departments`.`department_name`, `ud`.`full_name` as `hr_name`
FROM `onboarding_requests`
JOIN `departments` ON `departments`.`id` = `onboarding_requests`.`department_id`
LEFT JOIN `user_details` `ud` ON `ud`.`user_id` = `onboarding_requests`.`hr_user_id`
WHERE `hod_user_id` = '8'
ORDER BY `onboarding_requests`.`created_at` DESC
---
    public function pending()
    {
        $userId = session()->get('id');

        $data = [
            'requests' => $this->onboardingModel->select('onboarding_requests.*, departments.department_name, ud.full_name as hr_name')
                ->join('departments', 'departments.id = onboarding_requests.department_id')
                ->join('user_details ud', 'ud.user_id = onboarding_requests.hr_user_id', 'left')
                ->where('hod_user_id', $userId)
                ->orderBy('onboarding_requests.created_at', 'DESC')
                ->findAll(),
            'page_title' => 'Onboarding Tasks'
        ];

SELECT `onboarding_requests`.*, `departments`.`department_name`, `onboarding_details`.*, `ud`.`full_name` as `hod_name`, `onboarding_details`.`admin_status`, `onboarding_details`.`hr_status`, `onboarding_details`.`ict_status`
FROM `onboarding_requests`
JOIN `departments` ON `departments`.`id` = `onboarding_requests`.`department_id`
JOIN `onboarding_details` ON `onboarding_details`.`request_id` = `onboarding_requests`.`id`
LEFT JOIN `user_details` `ud` ON `ud`.`user_id` = `onboarding_requests`.`hod_user_id`
ORDER BY `onboarding_requests`.`created_at` DESC
---
    public function facilitatorTasks()
    {
        $userId = session()->get('id');
        $userRoles = (array)(session()->get('roles') ?: [session()->get('role')]);

        $roles = $this->checkFacilitatorAccess();

        if (empty($roles)) {
            return redirect()->to('dashboard')->with('error', 'You do not have facilitator access.');
        }

        $query = $this->onboardingModel->select('onboarding_requests.*, departments.department_name, onboarding_details.*, ud.full_name as hod_name,
                    onboarding_details.admin_status, onboarding_details.hr_status, onboarding_details.ict_status')
            ->join('departments', 'departments.id = onboarding_requests.department_id')
            ->join('onboarding_details', 'onboarding_details.request_id = onboarding_requests.id')
            ->join('user_details ud', 'ud.user_id = onboarding_requests.hod_user_id', 'left');