app/Controllers/Onboarding.php

SELECT *
FROM `departments`
WHERE `manager_id` = '4'
---
    public function facilitatorTasks()
    {
        $userId = session()->get('id');

        $managedDepts = $this->departmentModel->where('manager_id', $userId)->findAll();