app/Controllers/Onboarding.php

SELECT `onboarding_requests`.*, `departments`.`department_name`, `ud`.`full_name` as `hr_name`
FROM `onboarding_requests`
JOIN `departments` ON `departments`.`id` = `onboarding_requests`.`department_id`
LEFT JOIN `user_details` `ud` ON `ud`.`user_id` = `onboarding_requests`.`hr_user_id`
WHERE `hod_user_id` = '8'
ORDER BY `onboarding_requests`.`created_at` DESC
---
    public function pending()
    {
        $userId = session()->get('id');

        $data = [
            'requests' => $this->onboardingModel->select('onboarding_requests.*, departments.department_name, ud.full_name as hr_name')
                ->join('departments', 'departments.id = onboarding_requests.department_id')
                ->join('user_details ud', 'ud.user_id = onboarding_requests.hr_user_id', 'left')
                ->where('hod_user_id', $userId)
                ->orderBy('onboarding_requests.created_at', 'DESC')
                ->findAll(),
            'page_title' => 'Onboarding Tasks'
        ];

SELECT `onboarding_requests`.*, `departments`.`department_name`, `onboarding_details`.*, `ud`.`full_name` as `hod_name`
FROM `onboarding_requests`
JOIN `departments` ON `departments`.`id` = `onboarding_requests`.`department_id`
JOIN `onboarding_details` ON `onboarding_details`.`request_id` = `onboarding_requests`.`id`
LEFT JOIN `user_details` `ud` ON `ud`.`user_id` = `onboarding_requests`.`hod_user_id`
ORDER BY `onboarding_requests`.`created_at` DESC
---
    public function facilitatorTasks()
    {
        $userId = session()->get('id');
        $userRole = session()->get('role');

        $roles = $this->checkFacilitatorAccess();

        if (empty($roles)) {
            return redirect()->to('dashboard')->with('error', 'You do not have facilitator access.');
        }

        $query = $this->onboardingModel->select('onboarding_requests.*, departments.department_name, onboarding_details.*, ud.full_name as hod_name,
                    onboarding_details.admin_status, onboarding_details.hr_status, onboarding_details.ict_status')
            ->join('departments', 'departments.id = onboarding_requests.department_id')
            ->join('onboarding_details', 'onboarding_details.request_id = onboarding_requests.id')
            ->join('user_details ud', 'ud.user_id = onboarding_requests.hod_user_id', 'left');

SELECT *
FROM `departments`
WHERE `manager_id` = '4'
---
    private function checkFacilitatorAccess()
    {
        $userId = session()->get('id');
        $userRole = session()->get('role');

        $managedDepts = $this->departmentModel->where('manager_id', $userId)->findAll();

SELECT *
FROM `assets`
WHERE   (
`id` = '1'
OR `asset_code` = '1'
OR `serial_number` = '1'
 )
 LIMIT 1
---
    public function getAssetByCode()
    {
        $code = $this->request->getGet('code');
        if (!$code) {
            return $this->response->setJSON(['success' => false, 'message' => 'No scan data provided']);
        }

        // Try to find by id (primary key), asset code, or serial number
        $asset = $this->assetModel->groupStart()
            ->where('id', $code)
            ->orWhere('asset_code', $code)
            ->orWhere('serial_number', $code)
            ->groupEnd()
            ->first();