app/Models/AuditLogModel.php

INSERT INTO `audit_logs` (`user_id`, `action`, `details`, `ip_address`, `created_at`) VALUES ('4', 'Facilitator Task Updated', 'Updated hr status to Completed for candidate: test 2', '127.0.0.1', '2026-02-01 15:56:16')
---
    public function log($action, $details = null)
    {
        $session = session();
        $ip = \Config\Services::request()->getIPAddress();

        // Convert localhost IPv6 to IPv4
        if ($ip === '::1') {
            $ip = '127.0.0.1';
        }

        $this->insert([
            'user_id'    => $session->get('id'),
            'action'     => $action,
            'details'    => $details,
            'ip_address' => $ip,
            'created_at' => date('Y-m-d H:i:s')
        ]);

SELECT `audit_logs`.*, `u`.`username`, `ud`.`full_name`
FROM `audit_logs`
LEFT JOIN `users` `u` ON `u`.`id` = `audit_logs`.`user_id`
LEFT JOIN `user_details` `ud` ON `ud`.`user_id` = `u`.`id`
ORDER BY `created_at` DESC
---
    public function getLogs()
    {
        return $this->select('audit_logs.*, u.username, ud.full_name')
                    ->join('users u', 'u.id = audit_logs.user_id', 'left')
                    ->join('user_details ud', 'ud.user_id = u.id', 'left')
                    ->orderBy('created_at', 'DESC')
                    ->findAll();