app/Models/HardwareRequestModel.php

    public function getRequestsWithDetails($userId = null)
    {
        $builder = $this->select('hardware_requests.*, user_details.full_name as requester_name, admin_details.full_name as admin_name')
            ->join('user_details', 'user_details.user_id = hardware_requests.user_id')
            ->join('user_details admin_details', 'admin_details.user_id = hardware_requests.admin_id', 'left');

        if ($userId) {
            $builder->where('hardware_requests.user_id', $userId);
        }

        return $builder->orderBy('hardware_requests.created_at', 'DESC')->findAll();
---
SELECT `hardware_requests`.*, `user_details`.`full_name` as `requester_name`, `admin_details`.`full_name` as `admin_name`
FROM `hardware_requests`
JOIN `user_details` ON `user_details`.`user_id` = `hardware_requests`.`user_id`
LEFT JOIN `user_details` `admin_details` ON `admin_details`.`user_id` = `hardware_requests`.`admin_id`
WHERE `hardware_requests`.`user_id` = '8'
ORDER BY `hardware_requests`.`created_at` DESC