app/Models/UserModel.php

    public function getUserWithDetails($username)
    {
        $user = $this->select('users.*, user_details.full_name, user_details.email')
            ->join('user_details', 'user_details.user_id = users.id')
            ->where('users.username', $username)
            ->first();
---
SELECT `users`.*, `user_details`.`full_name`, `user_details`.`email`, `r`.`role_name` as `system_role`
FROM `users`
JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
JOIN `roles` `r` ON `r`.`id` = `users`.`system_role_id`
WHERE `users`.`username` = 'superadmin'
 LIMIT 1

    public function getUserByIdWithDetails($id)
    {
        $user = $this->select('users.*, user_details.full_name, user_details.epf_number, user_details.email, d.department_name, user_details.department_id')
            ->join('user_details', 'user_details.user_id = users.id')
            ->join('departments d', 'd.id = user_details.department_id', 'left')
            ->where('users.id', $id)
            ->first();
---
SELECT `users`.*, `user_details`.`full_name`, `user_details`.`email`, `r`.`role_name` as `system_role`, `d`.`department_name`
FROM `users`
JOIN `user_details` ON `user_details`.`user_id` = `users`.`id`
JOIN `roles` `r` ON `r`.`id` = `users`.`system_role_id`
LEFT JOIN `departments` `d` ON `d`.`id` = `user_details`.`department_id`
WHERE `users`.`id` = '8'
 LIMIT 1