app/Views/layouts/main.php

                    </li>
                    <?php endif; ?>
                    <?php
                        $managedDepts = (new \App\Models\DepartmentModel())->where('manager_id', session()->get('id'))->findAll();
---
SELECT *
FROM `departments`
WHERE `manager_id` = '8'